# Config

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"  # Alternate versions of casks
tap "buo/cask-upgrade"  # Update casks with `brew cu`
cask_args appdir: "/Applications"

# Fonts

cask "font-fira-code-nerd-font"  # https://www.nerdfonts.com/

# Shell

brew "antidote"  # https://github.com/mattmc3/antidote
brew "direnv"  # https://direnv.net/
brew "starship"  # https://starship.rs/

# CLI

brew "awscli"
brew "azure-cli"
brew "gnupg"
brew "git"
brew "mas"  # https://github.com/mas-cli/mas
brew "pinentry-mac"
brew "tree"
brew "uv"
brew "wget"

# Apps

cask "docker"
cask "ghostty"
cask "google-chrome"
cask "grandperspective"
cask "microsoft-teams"
cask "notion"
cask "slack"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Menu bar

cask "1password-beta"  # https://1password.com/
cask "elgato-control-center"
cask "keepingyouawake"  # https://github.com/newmarcel/KeepingYouAwake
cask "linearmouse"  # https://github.com/lujjjh/LinearMouse
cask "meetingbar"  # https://github.com/leits/MeetingBar
mas "nextdns", id: 1464122853  # https://nextdns.io/
cask "rectangle"  # https://github.com/rxhanson/Rectangle
cask "stats"  # https://github.com/exelban/stats
