# Config

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"  # Alternate versions of casks
tap "buo/cask-upgrade"  # Update casks with `brew cu`
cask_args appdir: "/Applications"

# Shell

cask "font-fira-code-nerd-font"  # https://www.nerdfonts.com/
brew "starship"  # https://starship.rs/
brew "direnv"  # https://direnv.net/

# CLI

brew "awscli"
brew "azure-cli"
brew "ctop"  # https://github.com/bcicen/ctop
brew "gnupg"
brew "java"
brew "git"
brew "mas"  # https://github.com/mas-cli/mas
cask "ngrok"  # https://ngrok.com/
brew "node"
brew "pinentry-mac"
brew "ripgrep"  # https://github.com/BurntSushi/ripgrep
brew "shellcheck"  # https://github.com/koalaman/shellcheck
brew "terraform"
brew "tldr"  # https://tldr.sh/
brew "tree"
brew "wget"

# Go, Python, Rust

brew "go"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rustup-init"  # Afterwards, run `rustup-init` to install Rust

# Apps

cask "cakebrew"  # https://www.cakebrew.com/
cask "crossover"
cask "discord"
cask "docker"
cask "google-chrome"
cask "grandperspective"
cask "microsoft-teams"
cask "notion"
cask "slack"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zoom"

# Menu Bar

cask "1password-beta"  # https://1password.com/
cask "elgato-control-center"
cask "keepingyouawake"  # https://github.com/newmarcel/KeepingYouAwake
cask "linearmouse"  # https://github.com/lujjjh/LinearMouse
cask "lunar"  # https://lunar.fyi/
cask "meetingbar"  # https://github.com/leits/MeetingBar
mas "nextdns", id: 1464122853  # https://nextdns.io/
cask "rectangle"  # https://github.com/rxhanson/Rectangle
cask "stats"  # https://github.com/exelban/stats
cask "vitals"  # https://github.com/hmarr/vitals 
cask "xbar"  # https://github.com/matryer/xbar
