# Config

tap "homebrew/cask"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications", require_sha: true

# Shell

brew "fish"  # https://fishshell.com/
brew "starship"  # https://starship.rs/
brew "direnv"  # https://direnv.net/
brew "font-fira-code-nerd-font"  # https://www.nerdfonts.com/

# Apps

cask "cakebrew"  # https://www.cakebrew.com/
cask "crossover"
cask "docker"
cask "google-chrome"
cask "notion"
cask "pycharm"
cask "slack"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "virtualbox"
cask "vlc"
cask "whatsapp"

# CLI

brew "awscli"
brew "azure-cli"
brew "ctop"  # https://github.com/bcicen/ctop
brew "gcloud"
cask "java"
brew "git"
cask "ngrok"  # https://ngrok.com/
brew "node"
brew "python", link: true
brew "ripgrep"  # https://github.com/BurntSushi/ripgrep
brew "shellcheck"  # https://github.com/koalaman/shellcheck
brew "terraform"
brew "tldr"  # https://tldr.sh/
brew "tree"
brew "wget"

# Menu Bar

cask "1password"  # https://1password.com/
cask "keepingyouawake"  # https://github.com/newmarcel/KeepingYouAwake
cask "lunar"  # https://lunar.fyi/
cask "meetingbar"  # https://github.com/leits/MeetingBar
mas "nextdns", id: 1464122853  # https://nextdns.io/
cask "rectangle"  # https://github.com/rxhanson/Rectangle
cask "stats"  # https://github.com/exelban/stats
cask "vitals"  # https://github.com/hmarr/vitals 
cask "xbar"  # https://github.com/matryer/xbar
